// ІМПОРТУЄМО БІБЛІОТЕКИ БЕЗ ЯКИХ НЕ МОЖЕМО ПИСАТИ КОД
import React from "react";

// ІМПОРТУЄМО ПОТРІБНІ КОМПОНЕНТИ
import Page from "./component/Page";
import Header from "./component/Header";
import Balance from "./component/Balance";
import Menu from "./component/Menu";
import Payment from "./component/Payment";

// КОНФІГУРАЦІЯ ========================================
const START_BALANCE = 0; // стартовий баланс при запуску додатка
const LIMIT_BALANCE = 100000; // ліміт балансу, за який не можна виходити

// Починаємо писати код нашого дадатка
export default function App() {
  // ФУНКЦІОНАЛ БАЛАНСУ ========================

  // Ось тут тримаємо актуальне значення балансу
  const [balance, setBalance] = React.useState(START_BALANCE);
  // Ось тут тримаємо актуальне значення списка транзакцій (платежів)
  const [payment, setPayment] = React.useState([]);

  // Функція яка виконується кожен раз коли наш баланс змінився
  React.useEffect(() => {
    // Перевірка на ліміт балансу
    if (balance > LIMIT_BALANCE) {
      alert(`Ваш ліміт балансу: ${LIMIT_BALANCE}`);
      setBalance(START_BALANCE);
    }

    // Перевірка на мінусовий баланс
    if (balance < 0) {
      alert(`Ви використали усі свої гроші. Поповніть картку`);
      setBalance(START_BALANCE);
      // setBalance(0);
    }
    // Сюди записуються змінні при оновленні яких буде виконуватися функція
  }, [balance]);

  // ФУНКУЦІОНАЛ ТРАНЗАКЦІЙ (ПЛАТЕЖІВ) ===================================================

  // Функція для поповнення балансу
  const getMoney = () => {
    setBalance(balance + 100); // оновлюємо баланс

    setPayment([
      // створюємо нову транзакцію і записуємо її в список транзакцій
      {
        name: `Зарплата`, // назва транзакції
        amount: 100, // сума
        type: "+" // тип транзакції (+ або -)
      },
      ...payment // вказуємо що хочемо підтягнути також минулі транзакції в список
    ]);
  };

  // ===================================================

  // Функція для відправки грошей з балансу
  const sendMoney = () => {
    setBalance(balance - 150);

    setPayment([
      {
        name: `Переказ з картки`,
        amount: 150,
        type: "-"
      },
      ...payment
    ]);
  };

  // ===================================================

  // ===================================================

  // Функція для відправки грошей з балансу
  const sendPhone = () => {
    setBalance(balance - 200);

    setPayment([
      {
        name: `Поповнення телефону`,
        amount: 200,
        type: "-"
      },
      ...payment
    ]);
  };

  // ===================================================

  // СТВОРЕННЯ ІНТЕРФЕЙСУ ==========================================

  return (
    // компонент сторінки, який задає задній фон
    <Page>
      {/*  
        компонент шапки з нашою назвою додатка  */}
      <Header name="OschadBank 24" />

      {/* Компонент баланса в який передається
          Актуальне значення балансу та налаштування карточки  */}
      <Balance
        balance={balance} // сюди передаємо актуальне значення балансу
        cardDate="12/25" // термін дійсності карточки
        cardNumber="4035 2002 5682 3158" // номер карточки
        cardName="Універсальна картка" // назва карточки
        currency="UAH" // валюта
        photo="/photo/family.jpeg" // шлях до файлу фото фону картки
      />

      {/* Компонент меню з кнопками */}
      <Menu
        // ось сюди ми передаємо конфігурацію кнопок
        config={[
          {
            name: "Поповнення", // текст в кнопці
            onClick: getMoney, // підключаємо функцію поповнення грошей на баланс
            img: "/icon/sallary.svg" // вказуємо шлях до файлу картинки кнопки
          },
          {
            name: "Переказ",
            onClick: sendMoney,
            img: "/icon/transfers.svg"
          },
          {
            name: "Поповнення телефону",
            onClick: sendPhone,
            img: "/icon/phone.svg"
          }
        ]}
      />
      {/* компонент списка наших транзакцій
          в який ми передаємо список актуальних транзакцій
      */}
      <Payment payment={payment} />
    </Page>
  );
}
